---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Categories..::..Item Property
Categories Class See Also Send Feedback
---

Retrieves a category object matching an identifier.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | [Item[([( String])]) ](9e2a96fc-df10-2e33-e042-53360cc9724e.md) | Gets a category which has the specified name from this list of top-level categories. (Overrides [CategoryNameMap..::..Item[([( String])]) ](5c189fd7-6881-976e-5ab1-ffd349c67ef3.md).) |
|  | [Item[([( BuiltInCategory])]) ](562ddcba-8f15-7421-e7a5-6968ccef7b10.md) | Retrieves a category object corresponding to a BuiltInCategory id. |

# See Also

Categories Class

Categories Members

Autodesk.Revit.DB Namespace